config.org
#+TITLE: Emacs Keybindings
#+AUTHOR: Sushan Shakya
#+PROPERTY: header-args:elisp :tangle ./config.el
#+DESCRIPTION: EMACS Key Bindings to use with DOOM

* Theme

** Doom Theme

#+BEGIN_SRC elisp

(setq doom-theme 'doom-one)

#+END_SRC

** Font Family

#+BEGIN_SRC elisp

(setq doom-font (font-spec :family "Agave Nerd Font" :size 18))

#+END_SRC

* Emacs Reload

** Reload Config file only

#+BEGIN_SRC elisp

(defun my/reload-config ()
  "Reload `config.el` manually without restarting Doom."
  (interactive)
  (load-file (expand-file-name "~/.config/doom/config.el")))


(map! :leader "h r r" 'my/reload-config)

#+END_SRC

** Reload other configs in doom

#+BEGIN_SRC elisp

(map! :leader "h r R" 'doom/reload)

#+END_SRC

* Workspace

** Creating New Workspace

#+BEGIN_SRC elisp

(map! "s-N" '+workspace-new)

#+END_SRC

* Editor

** Relative Line numbering

#+BEGIN_SRC elisp

(setq display-line-numbers-mode 'relative)

#+END_SRC

* Windows

** Always Launch Doom in Full screen

#+BEGIN_SRC elisp

(add-to-list 'initial-frame-alist '(fullscreen . maximized))
(add-to-list 'default-frame-alist '(fullscreen . maximized))

(add-hook 'after-make-frame-functions
          (lambda (frame)
            (set-frame-parameter frame 'fullscreen 'maximized)))

#+END_SRC

** Delete Buffers

#+begin_src elisp

(map! "s-w" '+workspace/close-window-or-workspace)

#+end_src

** Restore Buffers

#+begin_src elisp

(defun restore-last-killed-buffer ()
  "Reopen the most recently killed buffer."
  (interactive)
  (let ((recently-killed (car kill-ring)))
    (if recently-killed
        (find-file recently-killed)
      (message "No recently killed buffer to restore."))))


(map! "s-T" 'restore-last-killed-buffer)

#+end_src

* Treemacs

** Toggle Treemacs

#+begin_src elisp

(map! "s-e" '+treemacs/toggle)
(map! "s-b" '+treemacs/toggle)
(map! :leader "e" '+treemacs/toggle)

#+end_src

** Relative Line Numbering

#+BEGIN_SRC elisp

(with-eval-after-load 'treemacs
  (defun my/enable-linum-in-treemacs ()
    "Enable line numbers in Treemacs."
    (display-line-numbers-mode 1))

  (add-hook 'treemacs-mode-hook #'my/enable-linum-in-treemacs))


#+END_SRC

* Terminal

** Toggle Terminal

#+begin_src elisp

(map! "s-u" '+term/toggle)

#+end_src


* Command Palette

** Open Comand Palette

#+BEGIN_SRC elisp

(map! "s-P" 'execute-extended-command)

#+END_SRC

* Window Navigation

** Split Windows

#+begin_src elisp

(map! "s-L" '+evil/window-vsplit-and-follow)
(map! "s-J" '+evil/window-split-and-follow)

#+end_src

** Move between Windows

#+begin_src elisp

(map! "s-j" 'evil-window-down)
(map! "s-k" 'evil-window-up)
(map! "s-h" 'evil-window-left)
(map! "s-l" 'evil-window-right)

#+end_src


* Copy Paste

** Interoperate copy & paste between system clipboard

#+BEGIN_SRC elisp

(global-set-key (kbd "s-c") 'kill-ring-save)   ;; Copy
(global-set-key (kbd "s-v") 'yank)             ;; Paste
(global-set-key (kbd "s-x") 'kill-region)      ;; Cut
(global-set-key (kbd "s-a") 'mark-whole-buffer) ;; Select All

#+END_SRC

** Duplicate Lines Down

#+BEGIN_SRC elisp

(defun my/duplicate-lines-down ()
  "Duplicate the selected region or current line below, keeping the new region selected."
  (interactive)
  (if (use-region-p)
      (let* ((beg (region-beginning))
             (end (region-end))
             (beg-line (progn (goto-char beg) (line-beginning-position)))
             (end-line (progn (goto-char end) (line-end-position))))
        (let ((text (buffer-substring beg-line end-line)))
          (goto-char end-line)
          (newline)
          (insert text)
          ;; Keep the newly duplicated region selected
          (set-mark end-line)
          (goto-char (+ end-line (length text)))))
    ;; Duplicate single line if no region is selected
    (let* ((line (buffer-substring (line-beginning-position) (line-end-position)))
           (pos (point))) ;; Save cursor position
      (end-of-line)
      (newline)
      (insert line)
      ;; Move cursor down to the new line
      (goto-char (+ pos (length line)))
      (set-mark (line-beginning-position)))))

(map! "s-d" 'my/duplicate-lines-down)

#+END_SRC


* Comments

** Comment the selected lines

#+BEGIN_SRC elisp

(defun my/comment-region-and-keep-selection ()
  "Comment the selected region or the current line, maintaining selection."
  (interactive)
  (if (use-region-p)
      (let* ((beg (region-beginning))
             (end (region-end))
             (beg-line (progn (goto-char beg) (line-beginning-position)))
             (end-line (progn (goto-char end) (line-end-position))))
        ;; Comment the selected region
        (comment-or-uncomment-region beg-line end-line)
        ;; Maintain selection
        (goto-char end-line)
        (set-mark beg-line))
    ;; If no region is selected, comment the current line
    (let ((line-start (line-beginning-position))
          (line-end (line-end-position)))
      (comment-or-uncomment-region line-start line-end)
      (goto-char line-start)
      (set-mark line-end))))

(map! "s-/" 'my/comment-region-and-keep-selection)

#+END_SRC


* Completion

** VIM Bindings for Completion

#+BEGIN_SRC elisp

(use-package vertico
  :ensure t
  :bind (:map vertico-map
              ("s-j" . vertico-next)
              ("s-k" . vertico-previous))
  :custom
  (vertico-cycle t)
  :init
  (vertico-mode))

#+END_SRC

* Auto Tangle ORG to .el

This ensures that `config.el` is always up to date.

#+begin_src elisp :tangle no
(defun my/org-babel-tangle-config ()
  "Auto-tangle `config.org` when saved."
  (when (string-equal (buffer-file-name)
                      (expand-file-name "~/.config/doom/config.org"))
    (org-babel-tangle)))

(add-hook 'after-save-hook #'my/org-babel-tangle-config)
#+end_src
